#  ---------------------------------------------------------------------------
#
#  Brewfile
#  macOS package definitions — install with: brew bundle --file=~/.dotfiles/homebrew/Brewfile
#
#  Sections:
#    1.  Core utilities
#    2.  Languages & runtimes
#    3.  Shell & terminal
#    4.  Networking & security
#    5.  Infrastructure & cloud
#    6.  Media
#    7.  Applications (casks)
#
#  ---------------------------------------------------------------------------


#  ---------------------------------------------------------------------------
#  1.  Core utilities
#  ---------------------------------------------------------------------------

brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "gnupg"
brew "htop"
brew "cmake"


#  ---------------------------------------------------------------------------
#  2.  Languages & runtimes
#  ---------------------------------------------------------------------------

brew "asdf"


#  ---------------------------------------------------------------------------
#  3.  Shell & terminal
#  ---------------------------------------------------------------------------

brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "grc"


#  ---------------------------------------------------------------------------
#  4.  Networking & security
#  ---------------------------------------------------------------------------

brew "nmap"


#  ---------------------------------------------------------------------------
#  5.  Infrastructure & cloud
#  ---------------------------------------------------------------------------

brew "helm"
brew "terraform"


#  ---------------------------------------------------------------------------
#  6.  Media
#  ---------------------------------------------------------------------------

brew "ffmpeg"


#  ---------------------------------------------------------------------------
#  7.  Applications (casks)
#  ---------------------------------------------------------------------------

# Productivity & security
cask "1password"
cask "iterm2"

# Browsers
cask "brave-browser"
cask "firefox"

# Communication
cask "signal"
cask "discord"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Development
cask "docker-desktop"
cask "postman"
cask "wireshark-app"

# Media
cask "vlc"
